jmeter/test-plans/BookingLoad.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Booking Load Test" enabled="true">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">https://restful-booker.herokuapp.com</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="NUM_THREADS" elementType="Argument">
            <stringProp name="Argument.name">NUM_THREADS</stringProp>
            <stringProp name="Argument.value">100</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="RAMP_UP" elementType="Argument">
            <stringProp name="Argument.name">RAMP_UP</stringProp>
            <stringProp name="Argument.value">60</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="DURATION" elementType="Argument">
            <stringProp name="Argument.name">DURATION</stringProp>
            <stringProp name="Argument.value">180</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
      <stringProp name="TestPlan.comments">Load Test: 100 users ramping over 60 seconds for 3 minutes
Simulates normal peak traffic with mixed personas</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <!-- HTTP Request Defaults -->
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
        <stringProp name="HTTPSampler.protocol">https</stringProp>
        <stringProp name="HTTPSampler.concurrentPool">4</stringProp>
      </ConfigTestElement>
      <hashTree/>

      <!-- Thread Group - Load Test -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Load Test Users" enabled="true">
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${NUM_THREADS}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${RAMP_UP}</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <longProp name="ThreadGroup.start_time">1609459200000</longProp>
        <longProp name="ThreadGroup.end_time">1609459200000</longProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${DURATION}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <!-- CSV Data Set for User Personas -->
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Load Booking Data" enabled="true">
          <stringProp name="filename">../data/bookings.csv</stringProp>
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="quoteChar">&quot;</stringProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>

        <!-- Auth Request - Get Token -->
        <HTTPSampler guiclass="HttpTestSampleGui" testclass="HTTPSampler" testname="POST /auth - Get Token" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"username":"admin","password":"password123"}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/auth</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSampler>
        <hashTree>
          <!-- Extract Token from Response -->
          <JSON_Extractor guiclass="TestBeanGUI" testclass="JSON_Extractor" testname="Extract Token" enabled="true">
            <stringProp name="JSONExtractor.referenceNames">token</stringProp>
            <stringProp name="JSONExtractor.jsonPathExprs">$.token</stringProp>
            <stringProp name="JSONExtractor.match_numbers">1</stringProp>
          </JSON_Extractor>
          <hashTree/>
        </hashTree>

        <!-- Read-Only User Tasks (50% weight) -->
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="Read-Only User" enabled="true">
          <stringProp name="IfController.condition">${randomValue} &lt; 0.50</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>
          <HTTPSampler guiclass="HttpTestSampleGui" testclass="HTTPSampler" testname="GET /booking - List All" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="HTTPSampler.path">/booking</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSampler>
          <hashTree/>
        </hashTree>

        <!-- Booking User Tasks (30% weight) -->
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="Booking User" enabled="true">
          <stringProp name="IfController.condition">${randomValue} &gt;= 0.50 &amp;&amp; ${randomValue} &lt; 0.80</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>
          <HTTPSampler guiclass="HttpTestSampleGui" testclass="HTTPSampler" testname="POST /booking - Create" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">{"firstname":"${firstname}","lastname":"${lastname}","totalprice":${totalprice},"depositpaid":${depositpaid},"bookingdates":{"checkin":"2024-06-${checkin_day}","checkout":"2024-06-${checkout_day}"},"additionalneeds":"${additionalneeds}"}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.path">/booking</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSampler>
          <hashTree/>
        </hashTree>

        <!-- Admin User Tasks (15% weight) -->
        <IfController guiclass="IfControllerPanel" testclass="IfController" testname="Admin User" enabled="true">
          <stringProp name="IfController.condition">${randomValue} &gt;= 0.80 &amp;&amp; ${randomValue} &lt; 0.95</stringProp>
          <boolProp name="IfController.evaluateAll">false</boolProp>
          <boolProp name="IfController.useExpression">true</boolProp>
        </IfController>
        <hashTree>
          <HTTPSampler guiclass="HttpTestSampleGui" testclass="HTTPSampler" testname="GET /booking - List All (Admin)" enabled="true">
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
              <collectionProp name="Arguments.arguments"/>
            </elementProp>
            <stringProp name="HTTPSampler.path">/booking</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          </HTTPSampler>
          <hashTree/>
        </hashTree>

        <!-- Random Value Generator for Persona Distribution -->
        <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Random Persona Selector" enabled="true">
          <stringProp name="variableName">randomValue</stringProp>
          <stringProp name="outputVariable">randomValue</stringProp>
          <stringProp name="minimumValue">0</stringProp>
          <stringProp name="maximumValue">100</stringProp>
          <stringProp name="perThread">true</stringProp>
        </RandomVariableConfig>
        <hashTree/>

        <!-- Think Time -->
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Think Time - 1-3 seconds" enabled="true">
          <stringProp name="ConstantTimer.delay">1000</stringProp>
        </ConstantTimer>
        <hashTree/>

        <!-- Results Listener -->
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <objProp name="saveConfig">
            <objProp name="SamplerSaveConfiguration">
              <boolProp name="time">true</boolProp>
              <boolProp name="latency">true</boolProp>
              <boolProp name="timestamp">true</boolProp>
              <boolProp name="success">true</boolProp>
              <boolProp name="label">true</boolProp>
              <boolProp name="code">true</boolProp>
              <boolProp name="message">true</boolProp>
              <boolProp name="threadName">true</boolProp>
              <boolProp name="dataType">true</boolProp>
              <boolProp name="encoding">false</boolProp>
              <boolProp name="assertions">true</boolProp>
              <boolProp name="subresults">true</boolProp>
              <boolProp name="responseData">false</boolProp>
              <boolProp name="samplerData">false</boolProp>
              <boolProp name="xml">false</boolProp>
              <boolProp name="fieldNames">true</boolProp>
              <boolProp name="inferenceEngine">false</boolProp>
            </objProp>
          </objProp>
          <stringProp name="filename">../results/LoadTest_Results.csv</stringProp>
        </ResultCollector>
        <hashTree/>

        <!-- Assertions -->
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert Response Code 200" enabled="true">
          <collectionProp name="Asserions">
            <stringProp name="-1">Assertion.response_data</stringProp>
            <stringProp name="1">200</stringProp>
          </collectionProp>
          <intProp name="Assertion.test_type">1</intProp>
          <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
          <boolProp name="Assertion.assume_success">false</boolProp>
          <intProp name="Assertion.test_type">6</intProp>
        </ResponseAssertion>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>